import React from "react";
import "./PrivacyPolicy.css"; // استيراد ملف التنسيق

const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy-container">
      <h1>سياسة الخصوصية</h1>
      <p>
        في مطعم <strong>Little Lemon</strong> نحن ملتزمون بحماية خصوصية عملائنا
        وضمان سرية المعلومات الشخصية التي يتم جمعه. تهدف سياسة الخصوصية
        <br /> هذه إلى توضيح كيفية جمع واستخدام ومشاركة المعلومات التي قد تقدمها
        عند استخدام خدماتنا أو زيارة موقعنا الإلكتروني.
      </p>

      <h2>1. جمع المعلومات الشخصية</h2>
      <p>
        نقوم بجمع المعلومات التي تقدمها طوعًا عند الحجز أو التسجيل في موقعنا،
        مثل الاسم، البريد الإلكتروني، ورقم الهاتف. نستخدم
        <br /> هذه المعلومات لإدارة حجوزاتك وتقديم خدمة أفضل.
      </p>

      <h2>2. استخدام المعلومات</h2>
      <p>
        نستخدم معلوماتك الشخصية لتخصيص تجربتك، التواصل معك بشأن الطلبات أو
        العروض الخاصة، وتحسين خدماتنا بشكل عام.
        <br />
      </p>

      <h2>3. حماية البيانات</h2>
      <p>
        نلتزم باستخدام تقنيات حديثة لحماية بياناتك الشخصية ومنع الوصول غير
        المصرح به أو التعديلات غير القانونية عليها.
      </p>

      <h2>4. مشاركة المعلومات</h2>
      <p>
        لا نشارك معلوماتك الشخصية مع أطراف ثالثة إلا في الحالات التي تقتضيها
        القوانين أو لتقديم الخدمة المطلوبة.
      </p>

      <p className="note">
        من خلال استخدامك لخدماتنا، فإنك توافق على سياسة الخصوصية هذه وتقر بحقنا
        في تعديلها إذا دعت الحاجة.
      </p>
    </div>
  );
};

export default PrivacyPolicy;
